benchmarking/sample.log
thread 1 created with print_secrets set to 10000
Running 20s test @ http://vault1:8200
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    68.19ms   37.92ms 253.50ms   86.80%
    Req/Sec    16.53      5.66    30.00     61.93%
  311 requests in 20.02s, 41.37MB read
Requests/sec:     15.54
Transfer/sec:      2.07MB
thread 1 made 313 requests including 313 lists and got 311 responses