benchmarking/sample.log
Number of secrets is: 10000
thread 1 created
Running 20s test @ http://vault:8200
  1 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    74.96ms   19.45ms 177.10ms   73.81%
    Req/Sec    53.29     12.72    80.00     56.00%
  1066 requests in 20.01s, 125.96KB read
Requests/sec:     53.26
Transfer/sec:      6.29KB
thread 1 made 1071 requests including 1071 writes and got 1066 responses